#+TITLE: Optimal control of SIS model.
#+AUTHOR: Serge Kruk
#+STARTUP: showall nolatexpreview
* Mainline.  Must enter through here to reset everything. 
#+BEGIN_SRC lisp :tangle "sources/control-sis.lisp" 
  (defun main (&optional (horizon 60) (infectives 100) (budget 30)  (branches 2))
    (reset-best)
    (format t "~%Starting search~%Horizon: ~a~%Infectives: ~a~%Budget:~a" horizon infectives budget) 
    (let ((solution (best-control horizon infectives 0 budget branches)))
      (format t "~%Best cost: ~a ~%Best infectives: ~a~%Best pgm: ~a ~%Leaves: ~a~%Nodes:~A"
              (get-cost solution) (get-infectives solution) (get-pgm solution) (get-leaves) (get-nodes))))
#+END_SRC
#+RESULTS:

#+BEGIN_SRC lisp :results output
(main)
#+END_SRC 

#+RESULTS:
#+begin_example

Starting search
Horizon: 60
Infectives: 100
Budget:30
Best cost: 544.071 
Best infectives: 50
Best pgm: (1 1 1 1 1 1 1 1 1 1 0 0 0 1 1 0 0 0 1 1 0 0 0 1 1 0 0 0 1 1 0 0 0 1
           1 0 0 0 1 1 0 0 0 1 1 0 0 0 1 1 0 0 0 1 1 0 0 0 0 0) 
Leaves: 5880
Nodes:123599
#+end_example

